#include "menu.h"

void menu_print(void)
{
    printf("1) Прочитать из файла\n");
    printf("2) Вывести таблицу\n");
    printf("3) Добавить запись\n");
    printf("4) Удалить запись\n");
    printf("5) Загрузить исходную таблицу в буфер\n");
    printf("6) Отсортиовать по оценкам таблицу с помощью quick sort\n");
    printf("7) Отсортиовать по оценкам таблицу с помощью bubble sort\n");
    printf("8) Отсортиовать по оценкам массив ключей с помощью quick sort\n");
    printf("9) Отсортиовать по оценкам массив ключей с помощью bubble sort\n");
    printf("10) Вывести массив ключей\n");
    printf("11) Вывести таблицу по массиву ключей\n");
    printf("12) Поиск студентов, живущих в съемном жилье, с заданным годом поступления\n");
    printf("13) Сохранить таблицу\n");
    printf("14) Замерный эксперимент\n");
    printf("15) Выйти\n");
}

